# Leyendo Bases de datos 2 (Data Lab)

# Instrucciones

- Crear una variable `path` que contenga la ruta a `baseball.db` dentro de la carpeta `data`.
- Crear una conexión `con` que conecte a nuestra variable path en tiempo real.
- Crear una variable `query` que contenga una petición SQL que lea los datos de la tabla `allstarfull`.
- Crear una variable `observations` usando el método `read_sql` de pandas.

#### Opcional
- Crear una variable `tables` que lea todos los datos de la table `sqlite_master`.
- Imaginar que estoy interesado en crear un *Hall of fame* del Baseball y necesito unirma y analizar las tablas para evaluar el top 3 de los mejores jugadores de baseball.

## Ejercicio

In [12]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

In [13]:
# Creamos la variable path que contenga la ruta de baseball.db
path = 'data/baseball.db'

In [14]:
# Creamos una conexión "con" que nos permita acceder en tiempo real a la base de datos
con = sq3.Connection(path)

In [15]:
# Creamos la variable query que contenga las peticiones SQL que lea todos los datos de una tabla

query = """
SELECT *
    FROM allstarfull
    ;
"""

allstar_observations = pd.read_sql(query, con)

In [16]:
# Imprimimos nuestros datos
all_tables = pd.read_sql('SELECT * FROM sqlite_master', con)
display(all_tables)

,type,name,tbl_name,rootpage,sql
0,table,allstarfull,allstarfull,2,"CREATE TABLE ""allstarfull"" (\n""index"" INTEGER,..."
1,index,ix_allstarfull_index,allstarfull,3,"CREATE INDEX ""ix_allstarfull_index""ON ""allstar..."
2,table,schools,schools,26,"CREATE TABLE ""schools"" (\n""index"" INTEGER,\n ..."
3,index,ix_schools_index,schools,31,"CREATE INDEX ""ix_schools_index""ON ""schools"" (""..."
4,table,batting,batting,99,"CREATE TABLE ""batting"" (\n""index"" INTEGER,\n ..."
5,index,ix_batting_index,batting,100,"CREATE INDEX ""ix_batting_index""ON ""batting"" (""..."

# OPCIONAL

Imprimir y analizar las tablas para evaluar el top 3 de mejores jugadores

In [19]:
best_query = """
SELECT playerID, sum(GP) AS num_games_played, AVG(startingPos) AS avg_starting_position
    FROM allstarfull
    GROUP BY playerID
    ORDER BY num_games_played DESC, avg_starting_position ASC
    LIMIT 3
"""

best = pd.read_sql(best_query, con)
display(best.head())

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588